In [ ]:
# 2.Perform	the	following	operations	using	Python	on	dataset Salary_Data.csv (Experience, Salary)
# 1.	Print all data from Salary_Data.csv
# 2.	Find the empty cell from Salary_Data.csv
# 3.	Count the missing values from column Experience
# 4.	List the Descriptive Statistics for given dataset
# 5.	Reset the default index of given dataset

In [2]:
#Print all data from Salary_Data.csv
import pandas as pd
import numpy as np
df=pd.read_csv('Salary_Data.csv')
df

    YearsExperience    Salary
0               1.1   39343.0
1               1.3   46205.0
2               1.5   37731.0
3               2.0   43525.0
4               2.2   39891.0
5               2.9   56642.0
6               3.0   60150.0
7               3.2   54445.0
8               3.2       NaN
9               3.7   57189.0
10              3.9   63218.0
11              4.0   55794.0
12              NaN   56957.0
13              4.1   57081.0
14              4.5   61111.0
15              4.9   67938.0
16              5.1       NaN
17              5.3   83088.0
18              5.9   81363.0
19              6.0   93940.0
20              NaN   91738.0
21              7.1   98273.0
22              7.9  101302.0
23              8.2  113812.0
24              8.7  109431.0
25              9.0  105582.0
26              9.5  116969.0
27              9.6  112635.0
28             10.3  122391.0
29             10.5  121872.0

In [8]:
# 2.	Find the empty cell from Salary_Data.csv
null_data=df.isnull().any()
print(null_data)

YearsExperience    True
Salary             True
dtype: bool

In [5]:
nul_values=df[df['YearsExperience'].isnull()]
print(nan_values)

    YearsExperience   Salary
12              NaN  56957.0
20              NaN  91738.0

In [6]:
null_values=df[df["Salary"].isnull()]
print(null_values)

    YearsExperience  Salary
8               3.2     NaN
16              5.1     NaN

In [13]:
null_values = df[df["Salary"].isnull() | df["YearsExperience"].isnull()]
print(null_values)

    YearsExperience   Salary
8               3.2      NaN
12              NaN  56957.0
16              5.1      NaN
20              NaN  91738.0

In [15]:
#3.	Count the missing values from column Experience
null_column_expericence=df[df["YearsExperience"].isnull()]
print(null_column_expericence)

    YearsExperience   Salary
12              NaN  56957.0
20              NaN  91738.0

In [17]:
# 4.	List the Descriptive Statistics for given dataset
data=df.describe();
print(data)

       YearsExperience         Salary
count        28.000000      28.000000
mean          5.307143   76772.000000
std           2.916229   28248.468791
min           1.100000   37731.000000
25%           3.150000   56430.000000
50%           4.700000   65578.000000
75%           7.975000  102372.000000
max          10.500000  122391.000000

In [20]:
df.reset_index(drop=True)
df.index=df.index+1
print(df)

    YearsExperience    Salary
1               1.1   39343.0
2               1.3   46205.0
3               1.5   37731.0
4               2.0   43525.0
5               2.2   39891.0
6               2.9   56642.0
7               3.0   60150.0
8               3.2   54445.0
9               3.2       NaN
10              3.7   57189.0
11              3.9   63218.0
12              4.0   55794.0
13              NaN   56957.0
14              4.1   57081.0
15              4.5   61111.0
16              4.9   67938.0
17              5.1       NaN
18              5.3   83088.0
19              5.9   81363.0
20              6.0   93940.0
21              NaN   91738.0
22              7.1   98273.0
23              7.9  101302.0
24              8.2  113812.0
25              8.7  109431.0
26              9.0  105582.0
27              9.5  116969.0
28              9.6  112635.0
29             10.3  122391.0
30             10.5  121872.0